frostfire45/Codewarrior/Lib/hc12c/include/mc9s12p64.h
        /*** SCIBDH - SCI  Baud Rate Register High; Several registers at the same address ***/
        union {
          struct {
            byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
            byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
            byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
            byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
            byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
            byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
            byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
            byte IREN        :1;                                       /* Infrared Enable Bit */
          } Bits;
          struct {
            byte grpSBR_8 :5;
            byte grpTNP :2;
            byte :1;
          } MergedBits;
        } SCIBDHSTR;
        #define SCIBDH                  _SCIBD.Overlap_STR.SCIASR1STR.Byte
        #define SCIBDH_SBR8             _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.SBR8
        #define SCIBDH_SBR9             _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.SBR9
        #define SCIBDH_SBR10            _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.SBR10
        #define SCIBDH_SBR11            _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.SBR11
        #define SCIBDH_SBR12            _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.SBR12
        #define SCIBDH_TNP0             _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.TNP0
        #define SCIBDH_TNP1             _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.TNP1
        #define SCIBDH_IREN             _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.Bits.IREN
        #define SCIBDH_SBR_8            _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.MergedBits.grpSBR_8
        #define SCIBDH_TNP              _SCIBD.Overlap_STR.SCIASR1STR.SameAddr_STR.SCIBDHSTR.MergedBits.grpTNP
        #define SCIBDH_SBR              SCIBDH_SBR_8
        
        #define SCIBDH_SBR8_MASK        1U
        #define SCIBDH_SBR9_MASK        2U
        #define SCIBDH_SBR10_MASK       4U
        #define SCIBDH_SBR11_MASK       8U
        #define SCIBDH_SBR12_MASK       16U
        #define SCIBDH_TNP0_MASK        32U
        #define SCIBDH_TNP1_MASK        64U
        #define SCIBDH_IREN_MASK        128U
        #define SCIBDH_SBR_8_MASK       31U
        #define SCIBDH_SBR_8_BITNUM     0U
        #define SCIBDH_TNP_MASK         96U
        #define SCIBDH_TNP_BITNUM       5U
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCIASR1STR;
    

    /*** SCIACR1 - SCI  Alternative Control Register 1; 0x000000C9 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCIACR1 - SCI  Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCIACR1STR;
        #define SCIACR1                 _SCIBD.Overlap_STR.SCIACR1STR.Byte
        #define SCIACR1_BKDIE           _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIACR1STR.Bits.BKDIE
        #define SCIACR1_BERRIE          _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIACR1STR.Bits.BERRIE
        #define SCIACR1_RXEDGIE         _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIACR1STR.Bits.RXEDGIE
        
        #define SCIACR1_BKDIE_MASK      1U
        #define SCIACR1_BERRIE_MASK     2U
        #define SCIACR1_RXEDGIE_MASK    128U
        
        /*** SCIBDL - SCI  Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
        } SCIBDLSTR;
        #define SCIBDL                  _SCIBD.Overlap_STR.SCIACR1STR.Byte
        #define SCIBDL_SBR0             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR0
        #define SCIBDL_SBR1             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR1
        #define SCIBDL_SBR2             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR2
        #define SCIBDL_SBR3             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR3
        #define SCIBDL_SBR4             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR4
        #define SCIBDL_SBR5             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR5
        #define SCIBDL_SBR6             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR6
        #define SCIBDL_SBR7             _SCIBD.Overlap_STR.SCIACR1STR.SameAddr_STR.SCIBDLSTR.Bits.SBR7
        
        #define SCIBDL_SBR0_MASK        1U
        #define SCIBDL_SBR1_MASK        2U
        #define SCIBDL_SBR2_MASK        4U
        #define SCIBDL_SBR3_MASK        8U
        #define SCIBDL_SBR4_MASK        16U
        #define SCIBDL_SBR5_MASK        32U
        #define SCIBDL_SBR6_MASK        64U
        #define SCIBDL_SBR7_MASK        128U
        
